Repository: MohamedElkerm/Cash_Toggar_App
Catalog: lib/l10n/intl_*.arb
Languages: ar

# brandName
source: Cash Toggar
ar: كاش تجار

# onBoardingHeaderOne
source: Select the service you need
ar: حدد العملية اللي تحتاجها

# onBoardingHeaderTwo
source: Secure Money Transfer
ar: تحويل آمن للأموال

# onBoardingHeaderThree
source: Speed and Ease of Transfer
ar: سرعة وسهولة التحويل

# onBoardingBodyOne
source: Cash merchants provide you with easy and secure withdrawals and transfers from your wallet to Instapay.
ar: كاش تجار يوفر لك السحب والتحويل بسهولة وأمان من محفظتك إلى إنستاباي.

# onBoardingBodyTwo
source: Enjoy a seamless and secure experience for transferring money quickly with Cash Merchants.
ar: استمتع بتجربة سلسة وآمنة لتحويل الأموال بسرعة مع كاش تجار.

# onBoardingBodyThree
source: Cash Merchants offers you a unique experience for transferring money quickly, easily, and securely.
ar: كاش تجار يمنحك تجربة فريدة لتحويل الأموال بسرعة وسهولة وأمان.

source: skip
ar: تخطي

source: Next
ar: التالي

# previous
source: back
ar: للخلف

source: Enter
ar: دخول

# signIn
source: Login
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

# enterEmail
source: enter your email address here ...
ar: إدخل البريد الإلكتروني هنا ...

source: Password
ar: كلمة المرور

# enterPassword
source: enter your password here ...
ar: إدخل رقم المرور هنا ...

# forgotPassword
source: Forget Password?
ar: نسيت كلمة المرور؟

# dontHaveAccount
source: Don’t have an account?
ar: ليس لديك حساب؟

# createAccount
source: Create new an account
ar: إنشاء حساب جديد

# signUp
source: Create an account
ar: إنشاء حساب جديد

source: First Name
ar: الإسم الأول

# enterFirstName
source: enter first name here ...
ar: إدخل الإسم الأول هنا ...

source: Last Name
ar: الإسم الأخير

# enterLastName
source: enter last name here ...
ar: إدخل الإسم الأخير هنا ...

source: Phone Number
ar: رقم الهاتف

# enterPhoneNumber
source: enter phone number here ...
ar: إدخل رقم الهاتف هنا ...

# agreeConditions
source: agree to the terms & conditions of كاش تجار & the privacy policy.
ar: أوافق علي الشروط والأحكام كاش تجار وسياسة الخصوصية

# craeteAccount
source: Create an account
ar: إنشاء الحساب

# alreadyHaveAccount
source: Already Have an account?
ar: لديك حساب بالفعل؟

# signInHere
source: Login
ar: سجل دخول الآن

source: Home
ar: الرئيسية

source: profile
ar: حسابي

source: Transactions
ar: المعاملات

# googMorning
source: Good Morning
ar: صباح الخير

# goodAfternoon
source: Good Evening
ar: مساء الخير

# sendingMoney
source: Deposit
ar: إيداع

# receiveMoney
source: Withdraw
ar: سحب

# myCurrentMoney
source: Balance
ar: رصيد الحساب

source: Transaction history
ar: سجل المعاملات

# seeAll
source: show all
ar: عرض الكل

# sendingMoneyProcess
source: Account Deposits
ar: إيداعات الحساب

# receiveMoneyProcess
source: Withdraw Funds
ar: سحب الأموال

# refillMyAccount
source: Account Refill
ar: إعادة تعبئة الحساب

# chooseYourBestGatewayForeReceiveMoney
source: Select the payment method you wish to use to withdraw funds
ar: حدد نظام الدفع الذي ترغب في إستخدامه لسحب الأموال

# chooseYourBestGatewayForeSendingMoney
source: Select the payment method you wish to use to top up your account
ar: حدد نظام الدفع الذي ترغب في إستخدامه لشحن حسابك

# currentGateway
source: Recommended Methods
ar: الطرق الموصي بيها

# alertMessageWhenCreateRequest
source: Before submitting the request, please transfer the funds within 10 minutes using the payment information provided below
ar: قبل تقديم الطلب، يرجي تحويل الأموال في غضون 10 دقائق بإستخدام معلومات الدفع المحددة أدناه

# amount
source: Money:
ar: المبلغ

# moneyRange
source: The minimum is 15 LE - the maximum is 60,000 LE
ar: الحد الأدني 15LE - الحد الأقصي 30,000LE

# phoneNumberThatSendingMoney
source: phone number transferred made from
ar: رقم الهاتف الذي تم التحويل منه

# phoneNumberThatReceivingMoney
source: phone number will receive to
ar: رقم الهاتف الذي تريد التحويل اليه

# screenshotOfTransaction
source: Screenshot of a successful transfer
ar: إسكرين شوت لعملية تحويل ناجحة

# uploadTheImage
source: Upload screenshot here
ar: رفع إسكرين شوت هنا

source: Confirm
ar: التاكيد

# alertHeaderSendRequestDone
source: Your request is under review
ar: طلبك قيد المراجعة

# alertBodySendRequestDone
source: The review process may take approximately 5 to 10 minutes
ar: قد تستغرق عملية المراجعة حوالي 5 إلي 10 دقائق

# alertBodySendRequestDone2
source: Once the review is complete, we will notify you via SMS
ar: بمجرد إكتمال المراجعة، سنعلمك عبر رسالة قصيرة

# backToHome
source: Back to Home Page
ar: الرجوع إلي الصفحة الرئيسية

# userInformation
source: Personal Informations
ar: المعلومات الشخصية

source: Change Password
ar: تغيير كلمة المرور

# changeLanguage
source: Language Setting
ar: تغيير اللغة

source: Logout
ar: تسجيل الخروج

# callUs
source: Call Center
ar: خدمة العملاء

# rateUs
source: Rate us on Google Play
ar: التقييم علي جوجل بلاي

source: day
ar: اليوم

source: Cash back
ar: كاش باك

source: Wallet Balance
ar: رصيد المحفظة

source: Deposit successful
ar: تم الايداع بنجاح

source: Withdrawal successful
ar: تم السحب بنجاح

source: Deposit rejected
ar: تم رفض الايداع

source: Withdrawal rejected
ar: تم رفض السحب

source: Transaction pending
ar: العمليه قيد الانتظار

source: Complete Transaction
ar: اتمام العمليه

# vodafoneCashNum
source: Vodafone Cash Number
ar: رقم فودافون كاش

# validatorFirstName
source: Please enter your first name
ar: برجاء ادخال الاسم الاول

# validatorFirstNameWrong
source: First name should contain only letters
ar: الاسم الاول حروف فقط

# validatorLastName
source: Please enter your last name
ar: برجاء ادخال الاسم الاخير

# validatorLastNameWrong
source: Last name should contain only letters
ar: الاسم الاخير حروف فقط

# validatorEmail
source: Please enter your email
ar: برجاء ادخال الايميل

# validatorEmailValid
source: Please enter a valid email
ar: برجاء ادخال ايميل صالح

# validatorPassword
source: Please enter your password
ar: برجاء ادخال كلمه مرور

# validatorPassword2
source: Password must be at least 8 characters long
ar: كلمه السر يجب ان تكون اكثر من 8 احرف و رموز

# validatorPhoneNumber
source: Please enter your phone number
ar: برجاء ادخال رقم هاتف

# signInSuccess
source: Sign in successful!
ar: تم تسجيل الدخول بنجاح!

# signUpSuccess
source: Sign up successful!
ar: تم انشاء الحساب بنجاح!

# signInError
source: Error in sign in!
ar: برجاء ادخال البيانات بشكل صحيح

# signUpError
source: Error in sign up!
ar: برجاء ادخال البيانات بشكل صحيح

source: Withdraw funds via
ar: سحب الاموال بواسطه

source: my points
ar: نقاطي

# validatorAmountEmpty
source: Please enter your amount
ar: برجاء ادخال مبلغ

# validatorAmountNotEnough
source: your cash not enough
ar: حسابك غير كافي

# validatorPhoneEmpty
source: Please enter your phone
ar: برجاء ادخال رقم هاتف

# validatorAccountInstapayEmpty
source: Please enter your instapay account
ar: برجاء ادخال حساب انستا باي الخاص بك

# imageValidator
source: Please pick an image first
ar: يرجي ارفاق صوره اولا

# passwordReset
source: Password Reset Send Successfully
ar: تم ارسال اعاده تعيين كلمه السر بنجاح

# failedMessage
source: failed at this time pleas try again later
ar: برجاء اعاده المحاوله لاحقا

# copySuccess
source: copied successfully
ar: تم النسخ بنجاح

# instapayAddress
source: Insta@username
ar: عنوان الحساب @
